Revit 2017 API
StructuralSectionRectangularBar Class
 Defines parameters for Rectangular Bar structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionRectangularBar : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionRectangularBar _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionRectangularBar : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
See Also
StructuralSectionRectangularBar Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace